"""
{}      大括号就是字典的创建符号
<class 'dict'>  字典类型

字典中数据的形式都是键值对的形式  key: value
    key: value  键值对之间用英文状态下的冒号隔开
    key -->
        冒号左边是键
        键可以是: 字符串/数值/元组/布尔类型, 列表不行, 因为这个键不能被修改
        在一个字典中, 键必须唯一
        可以根据键取对应的值   字典名[键]
    value  -->
        冒号右边是键的值, 值可以是任意的Python类型 , 列表, 字典, 元组, 集合  --> 嵌套数据
"""
dict1 = {
    'name': '丸子',

    15: 20,

    ('你好',): {
        'name': '丸子',
        15: 20,
        ('你好',): {'sex': '女'},
        True: [1, 2, 3, 4, 5],
    },

    True: [1, 2, 3, 4, 5],
    # [1,2,3]: '列表'

}

print(dict1)
print(type(dict1))
print(dict1['name'])
print(dict1[15])
print(dict1[('你好',)])
print(dict1[True])

# 空字典的创建
dict2 = {}
dict3 = dict()
